app/Controllers/Universos.php

    public function listadoUniversos()
    {

        //lista los datos
        $lista = $this->universos->findAll();
---
SELECT *
FROM `TBL_UNIVERSOS`