app/Models/PersonajesModel.php

    public function personajesTotales()
    {
        // consulta datos personajes
        $query_personajes = $this->db->table('TBL_PERSONAJE P')
            ->select('P.ID_PERSONAJE AS ID, P.NOMBRE_PERSONAJE AS NOMBRE, P.IMAGEN AS IMAGEN, P.DESCRIPCION AS DESCRIPCION, R.NOMBRE_RAZA AS RAZA, P.BIOGRAFIA AS BIOGRAFIA, U.NOMBRE_UNIVERSO AS UNIVERSO')
            ->join('TBL_RAZA R', 'R.ID_RAZA = P.ID_RAZA')
            ->join('TBL_UNIVERSOS U', 'U.ID_UNIVERSO = P.ID_UNIVERSO')
            ->groupBy('P.ID_PERSONAJE')
            ->orderBy('P.NOMBRE_PERSONAJE', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `P`.`ID_PERSONAJE` AS `ID`, `P`.`NOMBRE_PERSONAJE` AS `NOMBRE`, `P`.`IMAGEN` AS `IMAGEN`, `P`.`DESCRIPCION` AS `DESCRIPCION`, `R`.`NOMBRE_RAZA` AS `RAZA`, `P`.`BIOGRAFIA` AS `BIOGRAFIA`, `U`.`NOMBRE_UNIVERSO` AS `UNIVERSO`, GROUP_CONCAT(PO.NOMBRE_PODER SEPARATOR ', ') AS PODERES
FROM `TBL_PERSONAJE` `P`
JOIN `TBL_RAZA` `R` ON `R`.`ID_RAZA` = `P`.`ID_RAZA`
JOIN `TBL_UNIVERSOS` `U` ON `U`.`ID_UNIVERSO` = `P`.`ID_UNIVERSO`
JOIN `TBL_PODERES_PERSONAJE` `PP` ON `P`.`ID_PERSONAJE` = `PP`.`ID_PERSONAJE`
JOIN `TBL_PODER` `PO` ON `PO`.`ID_PODER` = `PP`.`ID_PODER`
GROUP BY `P`.`ID_PERSONAJE`
ORDER BY `P`.`NOMBRE_PERSONAJE` ASC

    public function filtroNombre($nombre)
    {
        // consulta datos personajes filtrado x nombre
        $query_personajes = $this->db->table('TBL_PERSONAJE P')
            ->select('P.ID_PERSONAJE AS ID, P.NOMBRE_PERSONAJE AS NOMBRE, P.IMAGEN AS IMAGEN, P.DESCRIPCION AS DESCRIPCION, R.NOMBRE_RAZA AS RAZA, P.BIOGRAFIA AS BIOGRAFIA, U.NOMBRE_UNIVERSO AS UNIVERSO')
            ->join('TBL_RAZA R', 'R.ID_RAZA = P.ID_RAZA')
            ->join('TBL_UNIVERSOS U', 'U.ID_UNIVERSO = P.ID_UNIVERSO')
            ->where('P.NOMBRE_PERSONAJE', $nombre)
            ->groupBy('P.ID_PERSONAJE')
            ->orderBy('P.NOMBRE_PERSONAJE', 'ASC')
            ->get()
            ->getRow();

        // consulta poderes personajes
        $query_poderes = $this->db->table('TBL_PODERES_PERSONAJE PP')
            ->select('PP.ID_PERSONAJE AS ID, GROUP_CONCAT(PO.NOMBRE_PODER SEPARATOR \',\') AS PODERES')
            ->join('TBL_PODER PO', 'PO.ID_PODER = PP.ID_PODER')
            ->groupBy('PP.ID_PERSONAJE')
            ->get()
            ->getResult();
---
SELECT `P`.`ID_PERSONAJE` AS `ID`, `P`.`NOMBRE_PERSONAJE` AS `NOMBRE`, `P`.`IMAGEN` AS `IMAGEN`, `P`.`DESCRIPCION` AS `DESCRIPCION`, `R`.`NOMBRE_RAZA` AS `RAZA`, `P`.`BIOGRAFIA` AS `BIOGRAFIA`, `U`.`NOMBRE_UNIVERSO` AS `UNIVERSO`
FROM `TBL_PERSONAJE` `P`
JOIN `TBL_RAZA` `R` ON `R`.`ID_RAZA` = `P`.`ID_RAZA`
JOIN `TBL_UNIVERSOS` `U` ON `U`.`ID_UNIVERSO` = `P`.`ID_UNIVERSO`
WHERE `P`.`NOMBRE_PERSONAJE` = 'Goku'
GROUP BY `P`.`ID_PERSONAJE`
ORDER BY `P`.`NOMBRE_PERSONAJE` ASC
SELECT `PP`.`ID_PERSONAJE` AS `ID`, GROUP_CONCAT(PO.NOMBRE_PODER SEPARATOR ', ') AS PODERES
FROM `TBL_PODERES_PERSONAJE` `PP`
JOIN `TBL_PODER` `PO` ON `PO`.`ID_PODER` = `PP`.`ID_PODER`
GROUP BY `PP`.`ID_PERSONAJE`

    public function tarjetaID($idPersonaje)
    {
        // consulta datos personajes filtrado x id
        $query_personaje = $this->db->table('TBL_PERSONAJE P')
            ->select('P.ID_PERSONAJE AS ID, P.NOMBRE_PERSONAJE AS NOMBRE, P.IMAGEN AS IMAGEN, P.DESCRIPCION AS DESCRIPCION, R.NOMBRE_RAZA AS RAZA, P.BIOGRAFIA AS BIOGRAFIA, U.NOMBRE_UNIVERSO AS UNIVERSO')
            ->join('TBL_RAZA R', 'R.ID_RAZA = P.ID_RAZA')
            ->join('TBL_UNIVERSOS U', 'U.ID_UNIVERSO = P.ID_UNIVERSO')
            ->where('P.ID_PERSONAJE', $idPersonaje)
            ->groupBy('P.ID_PERSONAJE')
            ->orderBy('P.NOMBRE_PERSONAJE', 'ASC')
            ->get()
            ->getRow();

        // consulta poderes personajes
        $query_poderes = $this->db->table('TBL_PODERES_PERSONAJE PP')
            ->select('PP.ID_PERSONAJE AS ID, GROUP_CONCAT(PO.NOMBRE_PODER SEPARATOR \',\') AS PODERES')
            ->join('TBL_PODER PO', 'PO.ID_PODER = PP.ID_PODER')
            ->where('PP.ID_PERSONAJE', $idPersonaje)
            ->groupBy('PP.ID_PERSONAJE')
            ->get()
            ->getRow();
---
SELECT `PP`.`ID_PERSONAJE` AS `ID`, GROUP_CONCAT(PO.NOMBRE_PODER SEPARATOR ', ') AS PODERES
FROM `TBL_PODERES_PERSONAJE` `PP`
JOIN `TBL_PODER` `PO` ON `PO`.`ID_PODER` = `PP`.`ID_PODER`
WHERE `PP`.`ID_PERSONAJE` = '30'
GROUP BY `PP`.`ID_PERSONAJE`
SELECT `P`.`ID_PERSONAJE` AS `ID`, `P`.`NOMBRE_PERSONAJE` AS `NOMBRE`, `P`.`IMAGEN` AS `IMAGEN`, `P`.`DESCRIPCION` AS `DESCRIPCION`, `R`.`NOMBRE_RAZA` AS `RAZA`, `P`.`BIOGRAFIA` AS `BIOGRAFIA`, `U`.`NOMBRE_UNIVERSO` AS `UNIVERSO`
FROM `TBL_PERSONAJE` `P`
JOIN `TBL_RAZA` `R` ON `R`.`ID_RAZA` = `P`.`ID_RAZA`
JOIN `TBL_UNIVERSOS` `U` ON `U`.`ID_UNIVERSO` = `P`.`ID_UNIVERSO`
WHERE `P`.`ID_PERSONAJE` = '30'
GROUP BY `P`.`ID_PERSONAJE`
ORDER BY `P`.`NOMBRE_PERSONAJE` ASC